src/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ТоварыВРезерве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезерве</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ПартииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/CommonModules/ПроведениеСервер/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Общие механизмы проведения документов.
//
// Схема проведения («новая методика» с контролем остатков после записи движений):
//  1. ПодготовитьНаборыЗаписей - все наборы движений очищаются и помечаются к записи,
//     чтобы при перепроведении старые движения гарантированно заместились.
//  2. Данные документа читаются запросом, табличные части сворачиваются по ключам регистров.
//  3. Устанавливаются исключительные управляемые блокировки на контролируемые ключи -
//     до чтения остатков, иначе два параллельных документа увидят один и тот же остаток.
//  4. Формируются движения, контролируемые регистры записываются сразу.
//  5. Остатки проверяются запросом уже ПОСЛЕ записи движений: регистр сам сложил движения
//     всех строк документа по одному ключу, поэтому дубли номенклатуры в табличной части
//     не обходят контроль.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Очищает наборы записей движений документа и взводит у них флаг Записывать.
// Регистры, по которым документ при текущем проведении не сформирует записей,
// будут записаны пустыми - старые движения удалятся.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - проводимый документ.
//
Процедура ПодготовитьНаборыЗаписей(ДокументОбъект) Экспорт

	Для Каждого НаборЗаписей Из ДокументОбъект.Движения Цикл
		НаборЗаписей.Очистить();
		НаборЗаписей.Записывать = Истина;
	КонецЦикла;

КонецПроцедуры

// Записывает набор движений и снимает с него флаг Записывать, чтобы платформа
// не записала набор повторно после окончания обработки проведения.
//
// Параметры:
//  НаборЗаписей - РегистрНакопленияНаборЗаписей - набор движений документа.
//
Процедура ЗаписатьДвижения(НаборЗаписей) Экспорт

	НаборЗаписей.Записать();
	НаборЗаписей.Записывать = Ложь;

КонецПроцедуры

// Удаляет из базы ранее записанные движения документа, не меняя флаг Записывать у наборов.
// Нужно, когда остатки читаются на момент документа: если при перепроведении дата документа
// сдвинулась вперед, его старые движения оказались бы раньше новой границы и исказили остаток.
// Вызывать после установки блокировок.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - проводимый документ (наборы должны быть пустыми).
//
Процедура ОчиститьДвиженияВБазе(ДокументОбъект) Экспорт

	Для Каждого НаборЗаписей Из ДокументОбъект.Движения Цикл
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
	КонецЦикла;

КонецПроцедуры

// Удаляет все движения документа (используется при отмене проведения, когда после удаления
// движений нужно проконтролировать остатки).
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - документ.
//
Процедура УдалитьДвижения(ДокументОбъект) Экспорт

	Для Каждого НаборЗаписей Из ДокументОбъект.Движения Цикл
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
		НаборЗаписей.Записывать = Ложь;
	КонецЦикла;

КонецПроцедуры

// Возвращает пары (Номенклатура, Склад), по которым документ уже имеет движения
// в регистре ТоварыНаСкладах. Вызывать до перезаписи движений: при перепроведении
// из документа могли удалить строку, и по ее ключу тоже нужно проверить остаток.
//
// Параметры:
//  Регистратор - ДокументСсылка - документ.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Номенклатура, Склад.
//
Функция КлючиДвиженийТоваровВБазе(Регистратор) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладах.Склад КАК Склад
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
	|ГДЕ
	|	ТоварыНаСкладах.Регистратор = &Регистратор";

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Объединяет две таблицы ключей (Номенклатура, Склад) без повторов.
//
// Параметры:
//  Ключи1 - ТаблицаЗначений - колонки Номенклатура, Склад (типизированные).
//  Ключи2 - ТаблицаЗначений - колонки Номенклатура, Склад.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Номенклатура, Склад.
//
Функция ОбъединитьКлючи(Ключи1, Ключи2) Экспорт

	Результат = Ключи1.Скопировать(, "Номенклатура, Склад");
	Для Каждого СтрокаКлюча Из Ключи2 Цикл
		ЗаполнитьЗначенияСвойств(Результат.Добавить(), СтрокаКлюча, "Номенклатура, Склад");
	КонецЦикла;
	Результат.Свернуть("Номенклатура, Склад");

	Возврат Результат;

КонецФункции

// Добавляет в блокировку элемент: исключительная блокировка регистра по ключам из таблицы.
//
// Параметры:
//  Блокировка - БлокировкаДанных - блокировка, в которую добавляется элемент.
//  ПространствоБлокировки - Строка - например "РегистрНакопления.ТоварыНаСкладах".
//  ИсточникДанных - ТаблицаЗначений - ключи блокировки.
//  Поля - Строка - имена полей через запятую; в регистре и в источнике они называются одинаково.
//
Процедура ДобавитьБлокировкуПоКлючам(Блокировка, ПространствоБлокировки, ИсточникДанных, Поля) Экспорт

	Если ИсточникДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ЭлементБлокировки = Блокировка.Добавить(ПространствоБлокировки);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ИсточникДанных;
	Для Каждого ИмяПоля Из СтрРазделить(Поля, ",", Ложь) Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(СокрЛП(ИмяПоля), СокрЛП(ИмяПоля));
	КонецЦикла;

КонецПроцедуры

// Блокирует складские регистры (наличие, партии, резервы) по парам (Номенклатура, Склад).
//
// Параметры:
//  КлючиНоменклатураСклад - ТаблицаЗначений - колонки Номенклатура, Склад.
//  СПартиями - Булево - блокировать ли регистр ПартииТоваров.
//
Процедура ЗаблокироватьСкладскиеОстатки(КлючиНоменклатураСклад, СПартиями = Истина) Экспорт

	Если КлючиНоменклатураСклад.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Блокировка = Новый БлокировкаДанных;
	ДобавитьБлокировкуПоКлючам(Блокировка, "РегистрНакопления.ТоварыНаСкладах",
		КлючиНоменклатураСклад, "Номенклатура, Склад");
	ДобавитьБлокировкуПоКлючам(Блокировка, "РегистрНакопления.ТоварыВРезерве",
		КлючиНоменклатураСклад, "Номенклатура, Склад");
	Если СПартиями Тогда
		ДобавитьБлокировкуПоКлючам(Блокировка, "РегистрНакопления.ПартииТоваров",
			КлючиНоменклатураСклад, "Номенклатура, Склад");
	КонецЕсли;
	Блокировка.Заблокировать();

КонецПроцедуры

// Проверяет, что после записи движений свободный остаток (в наличии минус в резерве)
// по каждой паре (Номенклатура, Склад) неотрицателен. Остатки читаются на текущий момент,
// т.е. с учетом всех документов, в том числе более поздних.
//
// Параметры:
//  КлючиНоменклатураСклад - ТаблицаЗначений - колонки Номенклатура, Склад (типизированные).
//  Документ - ДокументСсылка - документ, к которому привязываются сообщения.
//  Отказ - Булево - устанавливается в Истина при нехватке.
//
Процедура ПроверитьСвободныеОстатки(КлючиНоменклатураСклад, Документ, Отказ) Экспорт

	Если КлючиНоменклатураСклад.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Ключи = КлючиНоменклатураСклад.Скопировать(, "Номенклатура, Склад");
	Ключи.Свернуть("Номенклатура, Склад");

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ключи", Ключи);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ключи.Номенклатура КАК Номенклатура,
	|	Ключи.Склад КАК Склад
	|ПОМЕСТИТЬ ВТКлючи
	|ИЗ
	|	&Ключи КАК Ключи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Склад КАК Склад,
	|	СУММА(Остатки.ВНаличии) КАК ВНаличии,
	|	СУММА(Остатки.ВРезерве) КАК ВРезерве
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыНаСкладах.Номенклатура КАК Номенклатура,
	|		ТоварыНаСкладах.Склад КАК Склад,
	|		ТоварыНаСкладах.КоличествоОстаток КАК ВНаличии,
	|		0 КАК ВРезерве
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				,
	|				(Номенклатура, Склад) В
	|					(ВЫБРАТЬ
	|						ВТКлючи.Номенклатура КАК Номенклатура,
	|						ВТКлючи.Склад КАК Склад
	|					ИЗ
	|						ВТКлючи КАК ВТКлючи)) КАК ТоварыНаСкладах
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ТоварыВРезерве.Номенклатура,
	|		ТоварыВРезерве.Склад,
	|		0,
	|		ТоварыВРезерве.КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ТоварыВРезерве.Остатки(
	|				,
	|				(Номенклатура, Склад) В
	|					(ВЫБРАТЬ
	|						ВТКлючи.Номенклатура КАК Номенклатура,
	|						ВТКлючи.Склад КАК Склад
	|					ИЗ
	|						ВТКлючи КАК ВТКлючи)) КАК ТоварыВРезерве) КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Номенклатура,
	|	Остатки.Склад
	|
	|ИМЕЮЩИЕ
	|	СУММА(Остатки.ВНаличии) - СУММА(Остатки.ВРезерве) < 0";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВРезерве = 0 Тогда
			Шаблон = НСтр("ru = 'Недостаточно товара «%1» на складе «%2»: не хватает %3'");
		Иначе
			Шаблон = НСтр("ru = 'Недостаточно свободного остатка товара «%1» на складе «%2»: не хватает %3 (зарезервировано под заказы: %4)'");
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон(Шаблон, Выборка.Номенклатура, Выборка.Склад,
				ОбщегоНазначенияКлиентСервер.ПредставлениеКоличества(Выборка.ВРезерве - Выборка.ВНаличии),
				ОбщегоНазначенияКлиентСервер.ПредставлениеКоличества(Выборка.ВРезерве)),
			Документ, , , Отказ);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
